node {
  name: "keras_tensor_4"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "keras_tensor_4"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 256
        }
        dim {
          size: 256
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "unknown"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27557"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_0"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27559"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_1"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27561"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_2"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27563"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_3"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27565"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_4"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27567"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_5"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27569"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_6"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27571"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_7"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27573"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_8"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27575"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_9"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27577"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_10"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27579"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_11"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27581"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_12"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27583"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_13"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27585"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_14"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27587"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "unknown_15"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "27589"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "StatefulPartitionedCall"
  op: "StatefulPartitionedCall"
  input: "keras_tensor_4"
  input: "unknown"
  input: "unknown_0"
  input: "unknown_1"
  input: "unknown_2"
  input: "unknown_3"
  input: "unknown_4"
  input: "unknown_5"
  input: "unknown_6"
  input: "unknown_7"
  input: "unknown_8"
  input: "unknown_9"
  input: "unknown_10"
  input: "unknown_11"
  input: "unknown_12"
  input: "unknown_13"
  input: "unknown_14"
  input: "unknown_15"
  attr {
    key: "Tin"
    value {
      list {
        type: DT_FLOAT
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_collective_manager_ids"
    value {
      list {
      }
    }
  }
  attr {
    key: "_read_only_resource_inputs"
    value {
      list {
        i: 4
        i: 5
        i: 6
        i: 7
        i: 8
        i: 9
        i: 10
        i: 11
        i: 12
        i: 13
        i: 14
        i: 15
        i: 16
        i: 17
      }
    }
  }
  attr {
    key: "config"
    value {
      s: ""
    }
  }
  attr {
    key: "config_proto"
    value {
      s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001\202\001\000\222\001\002J\000"
    }
  }
  attr {
    key: "executor_type"
    value {
      s: ""
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference___call___28838"
      }
    }
  }
}
node {
  name: "NoOp"
  op: "NoOp"
  input: "^StatefulPartitionedCall"
}
node {
  name: "Identity"
  op: "Identity"
  input: "StatefulPartitionedCall"
  input: "^NoOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
library {
  function {
    signature {
      name: "__inference___call___28838"
      input_arg {
        name: "keras_tensor_4"
        type: DT_FLOAT
      }
      input_arg {
        name: "sequential_1_1_sequential_1_random_flip_1_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_sequential_1_random_rotation_1_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_sequential_1_random_zoom_1_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_1_convolution_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_1_reshape_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_1_2_convolution_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_1_2_reshape_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_2_1_convolution_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_2_1_reshape_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_3_1_convolution_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_3_1_reshape_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_4_1_convolution_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_conv2d_4_1_reshape_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_dense_1_cast_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_dense_1_biasadd_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_dense_1_2_cast_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "sequential_1_1_dense_1_2_biasadd_readvariableop_resource"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "sequential_1_1/conv2d_1/Reshape/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_1/convolution/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_1_2/Reshape/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_1_2/convolution/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_2_1/Reshape/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_2_1/convolution/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_3_1/Reshape/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_3_1/convolution/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_4_1/Reshape/ReadVariableOp"
      control_output: "sequential_1_1/conv2d_4_1/convolution/ReadVariableOp"
      control_output: "sequential_1_1/dense_1/BiasAdd/ReadVariableOp"
      control_output: "sequential_1_1/dense_1/Cast/ReadVariableOp"
      control_output: "sequential_1_1/dense_1_2/BiasAdd/ReadVariableOp"
      control_output: "sequential_1_1/dense_1_2/Cast/ReadVariableOp"
      control_output: "sequential_1_1/sequential_1/random_flip_1/Add/ReadVariableOp"
      control_output: "sequential_1_1/sequential_1/random_flip_1/AssignVariableOp"
      control_output: "sequential_1_1/sequential_1/random_flip_1/ReadVariableOp"
      control_output: "sequential_1_1/sequential_1/random_rotation_1/Add/ReadVariableOp"
      control_output: "sequential_1_1/sequential_1/random_rotation_1/AssignVariableOp"
      control_output: "sequential_1_1/sequential_1/random_rotation_1/ReadVariableOp"
      control_output: "sequential_1_1/sequential_1/random_zoom_1/Add/ReadVariableOp"
      control_output: "sequential_1_1/sequential_1/random_zoom_1/AssignVariableOp"
      control_output: "sequential_1_1/sequential_1/random_zoom_1/ReadVariableOp"
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Shape"
      op: "Shape"
      input: "keras_tensor_4"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_type {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_SHAPE_TENSOR
          args {
            type_id: TFT_INT32
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice"
      op: "StridedSlice"
      input: "sequential_1_1/sequential_1/random_flip_1/Shape:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice/stack:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice/stack_1:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 1
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/ReadVariableOp"
      op: "ReadVariableOp"
      input: "sequential_1_1_sequential_1_random_flip_1_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/mul/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
            }
            int64_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/mul"
      op: "Mul"
      input: "sequential_1_1/sequential_1/random_flip_1/ReadVariableOp:value:0"
      input: "sequential_1_1/sequential_1/random_flip_1/mul/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Add/ReadVariableOp"
      op: "ReadVariableOp"
      input: "sequential_1_1_sequential_1_random_flip_1_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Add"
      op: "AddV2"
      input: "sequential_1_1/sequential_1/random_flip_1/Add/ReadVariableOp:value:0"
      input: "sequential_1_1/sequential_1/random_flip_1/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/AssignVariableOp"
      op: "AssignVariableOp"
      input: "sequential_1_1_sequential_1_random_flip_1_readvariableop_resource"
      input: "sequential_1_1/sequential_1/random_flip_1/Add:z:0"
      input: "^sequential_1_1/sequential_1/random_flip_1/Add/ReadVariableOp"
      input: "^sequential_1_1/sequential_1/random_flip_1/ReadVariableOp"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "validate_shape"
        value {
          b: true
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/FloorMod/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
            }
            int64_val: 2147483646
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/FloorMod"
      op: "FloorMod"
      input: "sequential_1_1/sequential_1/random_flip_1/mul:z:0"
      input: "sequential_1_1/sequential_1/random_flip_1/FloorMod/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Cast"
      op: "Cast"
      input: "sequential_1_1/sequential_1/random_flip_1/FloorMod:z:0"
      attr {
        key: "DstT"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "SrcT"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Truncate"
        value {
          b: false
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Cast_1/x"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Cast_2/x"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 1.0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/shape/1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/shape/2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/shape/3"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/shape"
      op: "Pack"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/shape/1:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/shape/2:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/shape/3:output:0"
      attr {
        key: "N"
        value {
          i: 4
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/StatelessRandomGetKeyCounter"
      op: "StatelessRandomGetKeyCounter"
      input: "sequential_1_1/sequential_1/random_flip_1/Cast:y:0"
      attr {
        key: "Tseed"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/StatelessRandomUniformV2/alg"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 3
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/StatelessRandomUniformV2"
      op: "StatelessRandomUniformV2"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/shape:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/StatelessRandomGetKeyCounter:key:0"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/StatelessRandomGetKeyCounter:counter:0"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/StatelessRandomUniformV2/alg:output:0"
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/sub"
      op: "Sub"
      input: "sequential_1_1/sequential_1/random_flip_1/Cast_2/x:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/Cast_1/x:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/mul"
      op: "Mul"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/StatelessRandomUniformV2:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/sub:z:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform"
      op: "AddV2"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform/mul:z:0"
      input: "sequential_1_1/sequential_1/random_flip_1/Cast_1/x:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Const_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.5
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/LessEqual"
      op: "LessEqual"
      input: "sequential_1_1/sequential_1/random_flip_1/stateless_random_uniform:z:0"
      input: "sequential_1_1/sequential_1/random_flip_1/Const_1:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Shape_1"
      op: "Shape"
      input: "keras_tensor_4"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_type {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_SHAPE_TENSOR
          args {
            type_id: TFT_INT32
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice_1/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice_1/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice_1/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice_1"
      op: "StridedSlice"
      input: "sequential_1_1/sequential_1/random_flip_1/Shape_1:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice_1/stack:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice_1/stack_1:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice_1/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 1
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/Shape_2"
      op: "Shape"
      input: "keras_tensor_4"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_type {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_SHAPE_TENSOR
          args {
            type_id: TFT_INT32
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice_2/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice_2/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice_2/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/strided_slice_2"
      op: "StridedSlice"
      input: "sequential_1_1/sequential_1/random_flip_1/Shape_2:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice_2/stack:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice_2/stack_1:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/strided_slice_2/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 1
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/ReverseV2/axis"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: -2
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/ReverseV2"
      op: "ReverseV2"
      input: "keras_tensor_4"
      input: "sequential_1_1/sequential_1/random_flip_1/ReverseV2/axis:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tidx"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/SelectV2"
      op: "SelectV2"
      input: "sequential_1_1/sequential_1/random_flip_1/LessEqual:z:0"
      input: "sequential_1_1/sequential_1/random_flip_1/ReverseV2:output:0"
      input: "keras_tensor_4"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/ReverseV2_1/axis"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: -3
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/ReverseV2_1"
      op: "ReverseV2"
      input: "sequential_1_1/sequential_1/random_flip_1/SelectV2:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/ReverseV2_1/axis:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tidx"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_flip_1/SelectV2_1"
      op: "SelectV2"
      input: "sequential_1_1/sequential_1/random_flip_1/LessEqual:z:0"
      input: "sequential_1_1/sequential_1/random_flip_1/ReverseV2_1:output:0"
      input: "sequential_1_1/sequential_1/random_flip_1/SelectV2:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/Shape"
      op: "Shape"
      input: "sequential_1_1/sequential_1/random_flip_1/SelectV2_1:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_type {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_SHAPE_TENSOR
          args {
            type_id: TFT_INT32
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/strided_slice/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/strided_slice/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/strided_slice/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/strided_slice"
      op: "StridedSlice"
      input: "sequential_1_1/sequential_1/random_rotation_1/Shape:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/strided_slice/stack:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/strided_slice/stack_1:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/strided_slice/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 1
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/ReadVariableOp"
      op: "ReadVariableOp"
      input: "sequential_1_1_sequential_1_random_rotation_1_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/mul/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
            }
            int64_val: 1
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/mul"
      op: "Mul"
      input: "sequential_1_1/sequential_1/random_rotation_1/ReadVariableOp:value:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/mul/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/Add/ReadVariableOp"
      op: "ReadVariableOp"
      input: "sequential_1_1_sequential_1_random_rotation_1_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/Add"
      op: "AddV2"
      input: "sequential_1_1/sequential_1/random_rotation_1/Add/ReadVariableOp:value:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/AssignVariableOp"
      op: "AssignVariableOp"
      input: "sequential_1_1_sequential_1_random_rotation_1_readvariableop_resource"
      input: "sequential_1_1/sequential_1/random_rotation_1/Add:z:0"
      input: "^sequential_1_1/sequential_1/random_rotation_1/Add/ReadVariableOp"
      input: "^sequential_1_1/sequential_1/random_rotation_1/ReadVariableOp"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "validate_shape"
        value {
          b: true
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/FloorMod/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
            }
            int64_val: 2147483646
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/FloorMod"
      op: "FloorMod"
      input: "sequential_1_1/sequential_1/random_rotation_1/mul:z:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/FloorMod/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/Cast"
      op: "Cast"
      input: "sequential_1_1/sequential_1/random_rotation_1/FloorMod:z:0"
      attr {
        key: "DstT"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "SrcT"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Truncate"
        value {
          b: false
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/Cast_1/x"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: -72.0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/Cast_2/x"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 72.0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/shape"
      op: "Pack"
      input: "sequential_1_1/sequential_1/random_rotation_1/strided_slice:output:0"
      attr {
        key: "N"
        value {
          i: 1
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/StatelessRandomGetKeyCounter"
      op: "StatelessRandomGetKeyCounter"
      input: "sequential_1_1/sequential_1/random_rotation_1/Cast:y:0"
      attr {
        key: "Tseed"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/StatelessRandomUniformV2/alg"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 3
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/StatelessRandomUniformV2"
      op: "StatelessRandomUniformV2"
      input: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/shape:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/StatelessRandomGetKeyCounter:key:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/StatelessRandomGetKeyCounter:counter:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/StatelessRandomUniformV2/alg:output:0"
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/sub"
      op: "Sub"
      input: "sequential_1_1/sequential_1/random_rotation_1/Cast_2/x:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/Cast_1/x:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/mul"
      op: "Mul"
      input: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/StatelessRandomUniformV2:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/sub:z:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform"
      op: "AddV2"
      input: "sequential_1_1/sequential_1/random_rotation_1/stateless_random_uniform/mul:z:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/Cast_1/x:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros/packed"
      op: "Pack"
      input: "sequential_1_1/sequential_1/random_rotation_1/strided_slice:output:0"
      attr {
        key: "N"
        value {
          i: 1
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros"
      op: "Fill"
      input: "sequential_1_1/sequential_1/random_rotation_1/zeros/packed:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/zeros/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "index_type"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros_1/packed"
      op: "Pack"
      input: "sequential_1_1/sequential_1/random_rotation_1/strided_slice:output:0"
      attr {
        key: "N"
        value {
          i: 1
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros_1/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros_1"
      op: "Fill"
      input: "sequential_1_1/sequential_1/random_rotation_1/zeros_1/packed:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/zeros_1/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "index_type"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/ones/packed"
      op: "Pack"
      input: "sequential_1_1/sequential_1/random_rotation_1/strided_slice:output:0"
      attr {
        key: "N"
        value {
          i: 1
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/ones/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 1.0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/ones"
      op: "Fill"
      input: "sequential_1_1/sequential_1/random_rotation_1/ones/packed:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/ones/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "index_type"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros_2/packed"
      op: "Pack"
      input: "sequential_1_1/sequential_1/random_rotation_1/strided_slice:output:0"
      attr {
        key: "N"
        value {
          i: 1
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros_2/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.0
          }
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros_2"
      op: "Fill"
      input: "sequential_1_1/sequential_1/random_rotation_1/zeros_2/packed:output:0"
      input: "sequential_1_1/sequential_1/random_rotation_1/zeros_2/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "index_type"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sequential_1_1/sequential_1/random_rotation_1/zeros_3/packed"
      op: "Pack"
